package level_1;

/*
Выведите в консоль все целые числа от 1 до 100.
 */
public class ex12_вывод_чисел {
  public static void main(String[] args) {
    for (int i = 0; i <= 100; i++) {
      System.out.println(i);
    }
  }
}
